In [1]:
import pandas as pd
import numpy as np

# Creating a dataframe from an array

## Option 1

In [2]:
#creating an array
data = np.array([[1,4], [2,5], [3,6]])

In [3]:
#creating a dataframe
pd.DataFrame(data)

   0  1
0  1  4
1  2  5
2  3  6

In [4]:
#specify the row and columns names
df = pd.DataFrame(data, index=['row1', 'row2', 'row3'], columns=['col1', 'col2'])

In [5]:
#showing the dataframe
df

      col1  col2
row1     1     4
row2     2     5
row3     3     6

## Option 2

In [6]:
#creating an array with list shape
data = np.array([[1,4], [2,5], [3,6]])

In [7]:
#create a dataframe
pd.DataFrame(data, index=['row1','row2', 'row3'],
            columns=['col1','col2'])

      col1  col2
row1     1     4
row2     2     5
row3     3     6

## Creating a DataFrame from a dictionary

In [8]:
#lists used for this example

states = ['California','Texas', 'Florida', 'New York']
population = [39613493, 29730311, 219944577, 199299981]

In [9]:
#storing lists within a dictionary
dict_states = {'States': states, 'Population': population}

In [10]:
#create a dataframe
df_population = pd.DataFrame(dict_states)

In [12]:
#showing the dataframe
df_population

       States  Population
0  California    39613493
1       Texas    29730311
2     Florida   219944577
3    New York   199299981

## Creating a dataframe from a csv file

In [17]:
#reading the csv file
df_exams = pd.read_csv('StudentsPerformance.csv')

In [18]:
#show the first 5 rows in a dataframe
df_exams.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75